app/controllers/accounts_controller.rb

  def create
    user = User.new(resources_params)
    user.save
---
INSERT INTO `users` (`name`, `username`, `password_digest`) VALUES ('ilhamashar', 'ilhamashars', '$2a$12$HEnX8OOBtS8SQMvkFAlFyukACbpN4Ui3mzXP3UjfUqgTCS1Ka2agm')