app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def show
    id = params[:id]
    @book = Book.find(id)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def create
    @book = Book.new(resources_params)
    if @book.save
---
INSERT INTO `books` (`title`, `price`, `page`, `description`, `created_at`, `updated_at`) VALUES ('mysql', 49999.0, 400, 'ha', '2020-06-30 15:18:06.716162', '2020-06-30 15:18:06.716162')

  def edit
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 9 LIMIT 1

  def update
    @book = Book.find(params[:id])
    @book.update(resources_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 10 LIMIT 1
UPDATE `books` SET `books`.`price` = 850000.0, `books`.`updated_at` = '2020-07-05 07:15:18.127293' WHERE `books`.`id` = 9

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 13 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 13